In [16]:
import numpy as np

**1. Write a Python program which iterates the integers from 1 to 30. For multiples of 3 print "Fizz" instead of the number and for the multiples of 5 print "Buzz". For numbers which are multiples of both 3 and 5 print "FizzBuzz".**

In [2]:
num=1
while(num<=30):
    if((num%3==0) & (num%5==0)):
        print(" FizzBuzz")
    elif(num%3==0):
        print(" Fizz")
    elif(num%5==0):
        print(" Buzz")
    else:
        print(num)
    num+=1
print("Done")

1
2
 Fizz
4
 Buzz
 Fizz
7
8
 Fizz
 Buzz
11
 Fizz
13
14
 FizzBuzz
16
17
 Fizz
19
 Buzz
 Fizz
22
23
 Fizz
 Buzz
26
 Fizz
28
29
 FizzBuzz
Done

**2. Write a Python program to count the number of even and odd numbers from a tuple of numbers.**
<br>
numbers=(12,15,3,6,26,33,56,65,78,37,42,99)

In [5]:
num=(12,15,3,6,26,33,56,65,78,37,42,90)
even=0
odd=0
for i in num:
    if not i % 2:
        even+=1
    else:
        odd+=1
print("Even count",even)
print("Odd count",odd)

Even count 7
Odd count 5

**3. Take 5 integers from keyboard using a loop and print their average value on the screen.**

In [1]:
list1=[]
a=1
while(a<=5):
    value=float(input("Enter numbers for a : "))
    list1.append(value)
    a+=1
#print(list1)
sum=0
for i in list1:
    sum=sum+i
print(sum)
avg=sum/len(list1)
print(avg)

Enter numbers for a : 2
Enter numbers for a : 2.5
Enter numbers for a : 6.5
Enter numbers for a : 4.5
Enter numbers for a : 1.5
17.0
3.4

In [ ]:
print("Enter 5 integer number to get the average")
sum=0
k=1
while(k<=5):
    value=int(input("Enter number :"))
    sum=sum+value
    k+=1
print("Avg of 5 numbers:",sum/5)

In [4]:
print("Input some integers to calculate their sum and average. Input 0 to exit.")

count = 0
sum = 0.0

while count < 5:
	number = int(input(""))
	sum = sum + number
	count += 1

if count == 0 :
	print("Input some numbers")
else:
	print("Average of the above numbers are: ", sum / (count))

Input some integers to calculate their sum and average. Input 0 to exit.
1
2
3
4
5
Average of the above numbers are:  3.0

**4. Following are the tuples of students who have enrolled for two courses. Find out those students who have enrolled for both the courses.**
<br>
course_A=('Anuj', 'Katrina', 'John', 'Jessica', 'Michael', 'Rahul', 'Khushboo')
<br>
course_B=('Bhavana', 'Katrina','Michael', 'Robert', 'Khushboo', 'Sachin' )

In [4]:
course_A=('Anuj', 'Katrina', 'John', 'Jessica', 'Michael', 'Rahul', 'Khushboo')
course_B=('Bhavana', 'Katrina','Michael', 'Robert', 'Khushboo', 'Sachin' )

setA=set(course_A)
setB=set(course_B)
print(setA&setB)

{'Khushboo', 'Katrina', 'Michael'}

**5. Write a Python function to create and print a list where the values are square of numbers between 1 and 25 (both included).**

In [13]:
import numpy as np
a=np.arange(1,26,1)
print('Sqaure of numbers from 1 to 25 :\n',a*a)

Sqaure of numbers from 1 to 25 :
 [  1   4   9  16  25  36  49  64  81 100 121 144 169 196 225 256 289 324
 361 400 441 484 529 576 625]

In [10]:
def printValues():
    l=list()
    for i in range(1,26):
        l.append(i**2)
    print(l)
printValues()

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576, 625]

**6. Write a Pandas program to create a Series out of the given list and sort it in the descending order.**
<br>
data_list=['1000', 'spyder', 'python', 'jupyter', '400.78', 'anaconda']

In [7]:
import pandas as pd

In [12]:

data=['1000', 'spyder','a', 'python', 'jupyter', '400.78', 'anaconda']
s=pd.Series(data)
print(s)

0        1000
1      spyder
2           a
3      python
4     jupyter
5      400.78
6    anaconda
dtype: object

**7. Create a series out of a range of values from 1 to 10. Ask the user to specify how many observations should be displayed and print that many observations from the series.**

In [ ]:
import numpy as np
import pandas as pd
data = np.arange(1,11,1)
s=pd.Series(data)
#observation=0
print('How many observations should be displayed from 1 to 10')
ob= float(input())
if ob>10:
    print('You have entered incorrect no')
else:
    print(s[:ob])

**8. Write a Pandas program to create the mean and standard deviation of the data of a given Series.**
<br>
data_list = [1,2,3,4,5,6,7,8,9,5,3]

In [13]:
data_list = [1,2,3,4,5,6,7,8,9,5,3]
s=pd.Series(data_list)
s.describe()
result=s.describe()
print(result)
print('\nMean is : ',result[1])
print('Standard Deviation is : ',result[2])

count    11.000000
mean      4.818182
std       2.522625
min       1.000000
25%       3.000000
50%       5.000000
75%       6.500000
max       9.000000
dtype: float64

Mean is :  4.818181818181818
Standard Deviation is :  2.522624895547565

**9. Write a Pandas program to display a summary of the basic information about the DataFrame and its data.**
<br>
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'],
'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [15]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'],
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=[labels])
print(df,'\n')
df.info()

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John    8.0         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 10 entries, (a,) to (j,)
Data columns (total 4 columns):
name        10 non-null object
score       10 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 426.0+ bytes

**10. Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the above data frame.**

In [16]:
#accessing above data elements using indexes and labels
#loc is used for row labels
#iloc is used for index no's

print(df.iloc[[1,3,5,6],[0,1]])

      name  score
b  Bhavana    9.0
d     John    8.0
f  Michael   20.0
g   Robert   14.5

**11. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2 and still did not qualify.**

In [17]:
df.loc[(df.attempts>2)&(df.qualify=='no')]

      name  score  attempts qualify
b  Bhavana    9.0         3      no
d     John    8.0         3      no

**12. Write a Pandas program to change the score in row 'd' to 11.5.**

In [18]:
df.set_value('d',['score'],[11.5])
df

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John   11.5         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**13. Write a Pandas program to change the name 'Jessica' to 'Suresh' in name column of the DataFrame.**

In [73]:
df.loc[(df.name=='Jessica'),['name']]=['Suresh']
df

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John   11.5         3      no
e    Suresh    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**14. Write a Pandas program to delete the 'attempts' column from the DataFrame.**

In [74]:
del df['attempts']
df

       name  score qualify
a      Anuj   12.5     yes
b   Bhavana    9.0      no
c   Katrina   16.5     yes
d      John   11.5      no
e    Suresh    9.0      no
f   Michael   20.0     yes
g    Robert   14.5     yes
h     Rahul    5.0      no
i  Khushboo    8.0      no
j    Sachin   19.0     yes

**15. Write a Pandas program to rearrange the columns of the dataframe. Follow the order:**
<br>
Qualify, Name, Score

In [75]:
df=df[['qualify','name','score']]
df

  qualify      name  score
a     yes      Anuj   12.5
b      no   Bhavana    9.0
c     yes   Katrina   16.5
d      no      John   11.5
e      no    Suresh    9.0
f     yes   Michael   20.0
g     yes    Robert   14.5
h      no     Rahul    5.0
i      no  Khushboo    8.0
j     yes    Sachin   19.0